[
  {
    "topic": "Конституційне право",
    "material_text": "<h1>Конституційне право України</h1><p><b>Конституційне право</b> — це провідна галузь національного права, яка закріплює основи суспільного ладу, форму правління й державного устрою, правовий статус особистості, порядок організації та компетенцію органів державної влади та місцевого самоврядування.</p><h2>Джерела та Основні принципи</h2><p>Основним джерелом є <b>Конституція України</b>, прийнята Верховною Радою України <b>28 червня 1996 року</b>. Вона має найвищу юридичну силу.</p><h3>Ключові принципи конституційного ладу:</h3><ul><li><b>Державний суверенітет:</b> Україна є суверенною і незалежною, демократичною, соціальною, правовою державою.</li><li><b>Народовладдя:</b> Носієм суверенітету і єдиним джерелом влади в Україні є народ.</li><li><b>Верховенство права:</b> Конституція має найвищу юридичну силу. Норми Конституції є нормами прямої дії.</li><li><b>Поділ влади:</b> Державна влада здійснюється на засадах її поділу на законодавчу, виконавчу та судову.</li></ul><h2>Система органів державної влади</h2><p>Відповідно до принципу поділу влади, в Україні діють:</p><ol><li><b>Законодавча влада:</b> представлена <u>Верховною Радою України</u> — єдиним органом законодавчої влади. Конституційний склад — 450 народних депутатів.</li><li><b>Виконавча влада:</b> вищим органом є <u>Кабінет Міністрів України</u>. Главою держави є <u>Президент України</u>, який виступає гарантом державного суверенітету, територіальної цілісності України, додержання Конституції, прав і свобод людини і громадянина.</li><li><b>Судова влада:</b> здійснюється судами. Найвищим судом у системі судоустрою є <u>Верховний Суд</u>. Окремим органом, що забезпечує верховенство Конституції, є <u>Конституційний Суд України</u>.</li></ol><h2>Права і свободи людини</h2><p>Розділ II Конституції закріплює широкий спектр прав і свобод, які є невідчужуваними та непорушними. В умовах воєнного або надзвичайного стану окремі права можуть бути тимчасово обмежені, однак існує перелік прав (ст. 64 КУ), які <b>не можуть бути обмежені за жодних обставин</b> (право на життя, право на повагу до гідності тощо).</p>"
  },
  {
    "topic": "Кримінальне право",
    "material_text": "<h1>Кримінальне право України</h1><p><b>Кримінальне право</b> — це галузь права, яка визначає, які суспільно небезпечні діяння є кримінальними правопорушеннями (злочинами) та які покарання застосовуються до осіб, що їх вчинили. Головне джерело — <b>Кримінальний кодекс України (ККУ)</b>.</p><h2>Склад кримінального правопорушення</h2><p>Це сукупність об'єктивних і суб'єктивних ознак, які характеризують діяння як злочин. Відсутність хоча б одного елемента виключає кримінальну відповідальність.</p><h3>Елементи складу злочину:</h3><ul><li><b>Об'єкт:</b> суспільні відносини, на які посягає злочин (наприклад, власність, життя, здоров'я).</li><li><b>Об'єктивна сторона:</b> зовнішній прояв злочину (діяння, наслідки, причинний зв'язок між ними).</li><li><b>Суб'єкт:</b> фізична осудна особа, яка досягла віку кримінальної відповідальності (загальний вік — 16 років, за тяжкі злочини — 14 років).</li><li><b>Суб'єктивна сторона:</b> внутрішнє психічне ставлення особи до вчиненого діяння. Основна ознака — <b>вина</b>, яка існує у формі умислу або необережності.</li></ul><h2>Стадії вчинення злочину</h2><ol><li><b>Готування до злочину:</b> створення умов для вчинення злочину (наприклад, підшукування зброї).</li><li><b>Замах на злочин:</b> діяння, безпосередньо спрямоване на вчинення злочину, але не доведене до кінця з причин, що не залежали від волі особи.</li><li><b>Закінчений злочин:</b> діяння, що містить усі ознаки складу злочину.</li></ol><h2>Обставини, що виключають кримінальну протиправність</h2><p>Це юридично значущі обставини, за наявності яких діяння, хоч і схоже на злочин, визнається правомірним. До них належать: <i>необхідна оборона, крайня необхідність, затримання особи, що вчинила злочин, фізичний або психічний примус</i> та інші.</p>"
  },
  {
    "topic": "Цивільне право",
    "material_text": "<h1>Цивільне право України</h1><p><b>Цивільне право</b> — це фундаментальна галузь права, що регулює особисті немайнові та майнові відносини (цивільні відносини), засновані на юридичній рівності, вільному волевиявленні та майновій самостійності їх учасників. Основне джерело — <b>Цивільний кодекс України (ЦКУ)</b>.</p><h2>Учасники цивільних відносин</h2><p>Учасниками (суб'єктами) є:</p><ul><li><b>Фізичні особи (громадяни України, іноземці):</b> характеризуються цивільною правоздатністю та дієздатністю.</li><li><b>Юридичні особи (підприємства, установи, організації):</b> діють на підставі статуту або положення.</li><li><b>Держава Україна, АР Крим, територіальні громади.</b></li></ul><h3>Правоздатність та дієздатність</h3><p><b>Цивільна правоздатність</b> — це здатність мати цивільні права та обов'язки. Вона виникає у момент народження людини. <br><b>Цивільна дієздатність</b> — це здатність своїми діями набувати для себе цивільних прав і самостійно їх здійснювати, а також створювати для себе обов'язки та самостійно їх виконувати. Повна дієздатність настає з 18 років (повноліття).</p><h2>Правочини та договори</h2><p><b>Правочин</b> — це дія особи, спрямована на набуття, зміну або припинення цивільних прав та обов'язків. Правочини можуть бути односторонніми (заповіт) або дво- чи багатосторонніми (договори).</p><p><b>Договір</b> є обов'язковим для виконання сторонами. Форма договору (усна, письмова, нотаріальна) залежить від вимог закону. Наприклад, договір купівлі-продажу нерухомості укладається у письмовій формі та підлягає нотаріальному посвідченню.</p><h2>Право власності</h2><p>Це ключовий інститут цивільного права. Власнику належить тріада прав: <b>володіння, користування та розпорядження</b> своїм майном.</p>"
  }
]